cfg/CalculationRegisters/УдержанияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>УдержанияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.УдержанияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйРезультат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

cfg/CalculationRegisters/УдержанияРаботниковОрганизаций/Forms/ФормаСпискаСторно/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ОрганизацияПриИзменении(Элемент)

	Заголовок = "Удержания работников организации " + Элемент.Значение.Наименование;
    Отбор.Организация.Использование = Не Элемент.Значение.Пустая();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Если форма открывается из списка документов, процедура заполняет организацию 
// прописывает заголовок формы и выставляет отбор регистру
//
Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Отбор.Организация.Значение = ПараметрОтборПоРегистратору.Организация;
			Заголовок				   = "Удержания работников организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина
			
		КонецЕсли;
		
		Отбор.Организация.Использование = Истина;
		
	Иначе
		
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
		Заголовок				   = "Удержания работников организации " + Отбор.Организация.Значение.Наименование;
	    Отбор.Организация.Использование		  = Не Отбор.Организация.Значение.Пустая();
		Отбор.Сторно.Значение 	   	  		  = Ложь;
		Отбор.Сторно.Использование 	  		  = Истина;
		Отбор.Активность.Значение 	  		  = Истина;
		Отбор.Активность.Использование		  = Истина;
		Отбор.Сотрудник.Значение		   	  = ВладелецФормы.ЭлементыФормы.Удержания.ТекущаяСтрока.Сотрудник;
        Отбор.Сотрудник.Использование    	  = Истина;
		Отбор.ПериодРегистрации.Значение      = ВладелецФормы.ЭлементыФормы.ПериодРегистрации.Значение;
		Отбор.ПериодРегистрации.ВидСравнения  = ВидСравнения.Меньше;
		Отбор.ПериодРегистрации.Использование = Истина;
		
	КонецЕсли;
	
	ЭлементыФормы.РегистрРасчетаСписок.РежимВыбора = РежимВыбора;
	
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Организация = ПараметрОтборПоРегистратору.Организация;
			Заголовок = "Удержания работников организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина;
			Возврат
			
		КонецЕсли;
		
		Отбор.Организация.Использование = Истина;

	Иначе
		
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	    Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
		Отбор.Сторно.Значение 	   	  		  = Ложь;
		Отбор.Сторно.Использование 	  		  = Истина;
		Отбор.Активность.Значение 	  		  = Истина;
		Отбор.Активность.Использование		  = Истина;
		Отбор.ФизЛицо.Значение		   		  = ВладелецФормы.ЭлементыФормы.Удержания.ТекущаяСтрока.Физлицо;
        Отбор.ФизЛицо.Использование    		  = Истина;
		Отбор.ПериодРегистрации.Значение      = ВладелецФормы.ЭлементыФормы.ПериодРегистрации.Значение;
		Отбор.ПериодРегистрации.ВидСравнения  = ВидСравнения.Меньше;
		Отбор.ПериодРегистрации.Использование = Истина;
		
	КонецЕсли;
	
	Заголовок = "Удержания работников организации ";
	ЭлементыФормы.Организация.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

Процедура РегистрРасчетаСписокВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	// получим данные записи регистра
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	*
						  |ИЗ
						  |	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
						  |
						  |ГДЕ
						  |	УдержанияРаботниковОрганизаций.Регистратор = &парамРегистратор И
						  |	УдержанияРаботниковОрганизаций.НомерСтроки = &парамНомерСтроки");
	Запрос.УстановитьПараметр("парамРегистратор", Значение.Регистратор);
	Запрос.УстановитьПараметр("парамНомерСтроки", Значение.НомерСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ОповеститьОВыборе(Выборка);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
